Revit 2027 API
CommonSharedAssetType Enumeration
 The enumerated type representing the permitted values for the asset property "CommonSharedAsset" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CommonSharedAssetType
Public Enumeration CommonSharedAssetType
public enum class CommonSharedAssetType
type CommonSharedAssetType
Members
Member name | Value | Description
Independent | 1
Shared | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace